gcdproof1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-03-21 Fri 16:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Galaxy Being" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org99c01cb">1. Proof</a>
<ul>
<li><a href="#org7f16d57">1.1. Formal Proof Summary</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org99c01cb" class="outline-2">
<h2 id="org99c01cb"><span class="section-number-2">1.</span> Proof</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li><b>Given:</b> We are given that \((a, b) = 1\), which means that \(a\) and \(b\) are relatively prime (coprime).</li>

<li><b>Let \(d = (a+b, a-b)\):</b> We want to show that \(d\) must be either \(1\) or \(2\). By definition, \(d\) divides both \(a+b\) and \(a-b\).</li>

<li><b>Linear Combinations:</b> Since \(d\) divides both \(a+b\) and \(a-b\), it must also divide any linear combination of them. Specifically:

<ul class="org-ul">
<li>\(d\) divides \((a+b) + (a-b) = 2a\)</li>
<li>\(d\) divides \((a+b) - (a-b) = 2b\)</li>
</ul></li>

<li><b>\(d\) Divides \(2a\) and \(2b\):</b> We have shown that \(d\) divides both \(2a\) and \(2b\). Thus, \(d\) must divide their greatest common divisor, so \(d\) divides \((2a, 2b)\).</li>

<li><b>Using the GCD Property:</b> We can use the property that \((ka, kb) = k(a, b)\) for any positive integer \(k\). Applying this:

<ul class="org-ul">
<li>\((2a, 2b) = 2(a, b)\)</li>
</ul></li>

<li><b>Substituting \((a, b) = 1\):</b> Since we are given that \((a, b) = 1\), we have:

<ul class="org-ul">
<li>\((2a, 2b) = 2(1) = 2\)</li>
</ul></li>

<li><b>\(d\) Divides 2:</b> We know that \(d\) divides \((2a, 2b)\), which equals \(2\). Therefore, \(d\) must divide \(2\).</li>

<li><b>Possible Values of \(d\):</b> The only positive divisors of \(2\) are \(1\) and \(2\).</li>

<li><b>Conclusion:</b> Therefore, \((a+b, a-b)\) must equal \(1\) or \(2\).</li>
</ol>
</div>
<div id="outline-container-org7f16d57" class="outline-3">
<h3 id="org7f16d57"><span class="section-number-3">1.1.</span> Formal Proof Summary</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Let \(d = (a+b, a-b)\). Since \(d\) divides \(a+b\) and \(a-b\), it divides
their sum and difference:
</p>

<ul class="org-ul">
<li>\(d | (a+b) + (a-b) = 2a\)</li>
<li>\(d | (a+b) - (a-b) = 2b\)</li>
</ul>

<p>
Thus, \(d | (2a, 2b)\). We know \((2a, 2b) = 2(a, b)\). Since \((a, b) = 1\), we have \((2a, 2b) = 2\). Therefore, \(d | 2\). The only positive divisors of \(2\) are \(1\) and \(2\), so \(d = 1\) or \(d = 2\).
</p>

<p>
Hence, \((a+b, a-b) = 1\) or \(2\).
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Galaxy Being</p>
<p class="date">Created: 2025-03-21 Fri 16:07</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
